<template>
    <section class="container-home">
      <pre>
        <h1 style="font-size:22px;font-weight:700;">智慧社区前端问题概述</h1>
        1.目前智慧社区需要新增的业务需求暂时不明确(以下内容不包括"系统管理模块")

        2.以目前前端代码角度而言,存在的问题在于:
            (1).前后端没有分离这样会导致开发效率低下,前端人员需依赖于后台搭建的框架进行开发，
            而且前端代码挤乱，会导致代码不方便维护，也不方便前端进行工程化；
            (2).前端未工程化，工程化可以提高前端的生成效率，并且项目代码更容易维护，打包后的
            文件可以减少请求数，降低请求量。
            (3).前端ui组件以及各种插件引入繁杂，导致页面很多地方组件之间相互影响，会产生很多
            非逻辑错误的bug，也不利于后期维护和需求变更后进行的第二次开发。
            (4).也因为前端的各种ui组件和插件的繁杂引入导致页面加载过慢。

        3.以目前就页面整体效果方面而言,存在的问题列出详情:
            (1).页面头部搜索,表格样式,表单验证样式,还有弹出框效果,提示框效果,树组件效果,tab栏
            效果以及部分类似时间控件,多选,单选,单选多选搜索,等这般组件样式不够统一。
            (2).部分页面个人觉得需要重新设计,有些还存在用户操作障碍(不包括组件不统一这块,以用户
            操作角度而言),类似:
                1.房产管理模块的"新增小区向导"页面,新增操作步骤,用户可能用起来不太舒服
                2.房产管理模块的'小区维护'页面也用的不太舒服,需要重新设计
                3.业主管理模块的'业主入住'页面,主要是增删改查功能,但觉得房产信息这块可以用可搜索
                下拉框展示,可能在操作方面我不太习惯,主要是看UI给予设计
                4.OA办公模块的"人事管理"页面,查询发面也可用下拉框替代,不需要单独展示一列
                以下也是觉得需要重新设计,以下也是一些操作不习惯的页面:
                5.物质管理模块的'物料清单'页面
                6.计费管理模块的'项目收费'页面和'收费标准'页面
                7.收费管理模块的'前台收费'页面
                8.巡检管理模块的'线路设置'页面

        4.以目前情况改进方面主要在于:
            (1).暂且不管页面的各种组件与包的引入,以单页面为基础,向样式统一化进行修改。
            (2).页面头部搜索,表格样式,表单验证样式,还有弹出框效果,提示框效果,树组件效果,tab栏
            效果以及部分类似时间控件,多选,单选,单选多选搜索,等这般组件样式进行统一。
            (3).部分体验不好的页面重新设计,重新优化,页面重新开发。

        5.目前智慧社区可以用到的统一组件有:
            (1)table 表格组件
            (2)tab 选项卡
            (3)form 表单(包括可搜索下拉,单选多选,时间控件,swich,radio选择等)
            (4)echats 统计图表视图
            (5)editor 富文本编辑
            (6)upload 文件上传
            (7)menu 多级菜单导航
            (8)qrcode 二维码生成器
            (9)dialog 弹窗
            (10)message 消息提示 或 Notification 通知
            (11)tree 树组件
            (12)transfer 穿梭框
            (13)pagination 分页
            (14)loadding 加载效果
            (15)step 步骤条
            (16)Tooltip 文字提示
            (17)403,404统一页面

        6.我们将对上述所有存在的功能在当前Demo项目中展示出来:
            当前项目采用webpack前端构件化工具(前端工程化),以vue框架,引用elementUI组件库
      </pre>
    </section>
</template>

<script>
import { api_register } from '../api/api';
export default {
  name: 'home',
  data () {
    return {

    }
  },
  methods: {
    test(){
      // this.$http({
      //     url:'/api/member/register',
      //     method:'post',
      //     data:{'a':1}
      // }).then(res=>{
      //
      // }),
      this.postRequest(api_register,{data:{'a':1}
      }).then(res=>{ 

      })
    }
  },
  computed:{

  },
  created(){
    this.test();
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scope>
  .container-home{
    padding: 10px;
    background-color: #fff;
  }
  .container-home{
    text-align: left;
  }
</style>
